Tekla Open API Reference for Tekla Structures 2025
SinglePartDrawing Constructor
Overload List
Name | Description
SinglePartDrawing(Identifier)
 Instantiates a new single part drawing with standard attributes.
SinglePartDrawing(Identifier, Int32)
 Instantiates a new single part drawing with standard attributes and with a specified sheet number.
SinglePartDrawing(Identifier, String)
 Instantiates a new single part drawing with given attributes.
SinglePartDrawing(Identifier, Int32, String)
 Instantiates a new single part drawing with standard attributes and with a specified sheet number.
Top
See Also
Reference
SinglePartDrawing Class
Tekla.Structures.Drawing Namespace